<template>
    <div class="queren">
        <p><br />
        </p>

        <p>请您仔细阅读并充分理解本借款确认书。本借款确认书采用电子签署方式，您自愿阅读并勾选同意，即视为已完全同意并接受本借款确认书，并愿受其约束，本借款确认书即成立并生效。您若不同意本借款确认书的任何条款，请不要勾选同意并停止使用本服务。</p>

        <p><br />
        </p>

        <p><b>一、综合资金成本及收取规则</b></p>

        <p><b>您（下文也称“借款人”）通过小赢平台提供的居间服务获得的借款综合资金成本年化为  【 <span>{{yearCost|cutFilter}}</span>】%，其中包括借款利率、咨询服务费费率、保费费率（如有）、担保费费率（如有）、资产处置服务费费率（如有）。还款方式为 【<span>{{repayType}}</span>】，咨询服务费、担保费（如有）及资产处置服务费（如有）为按月收取，保费（如有）收取规则为【全额放款至借款人绑定的银行卡后收取】，具体费率金额及收取规则以相关协议或还款计划表为准。</b></p>

        <p><br />
        </p>

        <p><b>二、贷款条件</b></p>

        <p>1. 申请人需为中国国籍，外国国籍不予受理；</p>

        <p>2. 年龄20-55周岁或25-55周岁，具体以借款人申请的产品具体要求为准；</p>

        <p>3. 必须为借款人本人申请，申请时该申请人的身份信息、银行卡、手机核实一致；</p>

        <p>4. 申请材料：申请人本人的二代身份证，申请人本人手机号码；</p>

        <p>5. 相关借款产品要求的其他条件。</p>

        <p><br />
        </p>

        <p><b>三、禁止性行为</b></p>

        <p><b>您承诺并保证不从事如下禁止性行为：</b></p>

        <p><b>（一）通过故意变换身份、虚构融资项目、夸大融资项目收益前景等形式的欺诈借款；</b></p>

        <p><b>（二）同时通过多个网络借贷信息中介机构，或者通过变换项目名称、对项目内容进行非实质性变更等方式，就同一融资项目进行重复融资；</b></p>

        <p><b>（三）在网络借贷信息中介机构以外的公开场所发布同一融资项目的信息；</b></p>

        <p><b>（四）已发现网络借贷信息中介机构提供的服务中含有《网络借贷信息中介机构业务活动管理暂行办法》第十条所列内容，仍进行交易；</b></p>

        <p><b>（五）法律法规和网络借贷有关监管规定禁止从事的其他活动。</b></p>

        <p><br />
        </p>

        <p><b>四、承诺与保证：</b></p>

        <p>您承诺并保证：</p>

        <ol > <li>融资项目真实、合法，并严格按照约定用途使用借贷资金，不会用于出借、购房等其他目的，不会将借款用于投资股票、场外配资、期货合约、结构化产品及其他衍生品等高风险产品，也不会将所借款项用于赌博等任何非法用途；</li>
            <li>提供真实、准确、完整的个人信息及融资信息，您提供的其他资料也均为真实、完整、有效，并且您进一步保证您不会提供任何虚假信息或隐瞒重要事实；</li>
            <li>若您为自然人，您保证您通过其他网络借贷信息中介机构平台完成的借款总余额与此次通过小赢平台向出借人的借款本金之和不超过人民币100万元。若您为法人，您保证您通过其他网络借贷信息中介机构平台完成的借款总余额与此次通过小赢平台向出借人的借款本金之和不超过人民币500万元。您保证真实披露了您通过其他网络借贷信息中介机构平台的借款情况；</li>
            <li>不会将借款合同及相关协议项下的债务转让给任何其他方；</li>
            <li>不会从事任何影响借款合同及相关协议项下出借人债权安全的行为；</li>
            <li>按照约定向出借人如实报告影响或可能影响出借人权益的重大信息；</li>
            <li>具有与借款金额相匹配的还款能力并按照借款合同约定还款，且还款资金来源是其合法合规自有资金，不存在“以贷养贷”、“多头借贷”等行为；</li>
            <li>不是在校学生，已年满20周岁，具有完全民事行为能力；</li>
            <li>签署借款合同及相关协议是出于真实的借款需求，不存在弄虚作假骗取借款、非法集资等违法违规的行为，且您确认小赢有权对您的相关信息(包括但不限于借款用途、还款资金来源)开展真实性调查，并无条件配合该等调查；</li>
            <li>按照借款合同及有关协议约定履行义务。</li>
        </ol><p><br />
    </p>

        <p><b>五、违约后果及逾期处理</b></p>

        <p><b>若您违反借款合同及相关协议约定，您需要承担下列责任：</b></p>

        <ol > <li><b>您的该笔借款若由保险公司承担保险责任，如借款发生逾期，保险公司将以“保证人代偿”通过中国人民银行上报您的逾期信息，若您的信用记录有“保证人代偿”的逾期信息，您可能会被银行、小额贷款公司等所有金融机构或类金融机构列入风控黑名单，将无法办理所有贷款业务，甚至影响您的信用卡申请及使用。若您的征信信息被记录有污点，或被列入失信人员黑名单，将直接影响您的生活及消费，如购买机票、高铁车票、星级酒店入住等。</b></li>
            <li><b>若发现您存在任何欺诈行为或其他损害出借人利益的情形，小赢及/或出借人有权立即终止本次借款，您应当承担违约责任及由此而引发的全部法律责任。</b></li>
            <li><b>您未按借款合同的约定于还款日或借款到期日24点前足额还款的，即视为逾期。您逾期的，出借人有权要求您立即进行偿付，且您除应偿还本金、利息外还应按相关借款合同约定支付逾期违约金。</b></li>
            <li><b>您未按借款合同约定用途使用借款的，出借人有权提前收回全部借款或解除借款合同，并对您违约使用的借款根据违约使用天数收取违约金（计算公式等同于逾期违约金）。</b></li>
            <li><b>若您存在借款合同约定的相应违约行为，您应按借款合同约定在小赢通知的期限内提前偿还应还款项，相应借款合同项下的借款于小赢通知的还款之日（以下简称“通知加速到期日”）加速到期。您应于通知加速到期日立即足额归还所有应付未付的本金和利息，您应足额归还全部本金及截至通知加速到期日当日的利息。您未在通知加速到期日按上述约定足额归还借款本息的，按逾期还款处理并以借款合同约定支付逾期违约金。</b></li>
            <li><b>若您未按借款合同约定偿还款项且符合借款合同约定的自动加速到期条件时，相关借款将会自动加速到期，您应于自动加速到期日立即足额归还所有应付未付的本金和利息，您应足额归还全部本金及截至自动加速到期日当日的利息。您未在自动加速到期日按上述约定足额归还借款本息的，按逾期还款处理并按借款合同约定支付逾期违约金。</b></li>
            <li><b>您承担违约责任（包括但不限于逾期违约金）的同时，仍应承担违约/逾期期间应正常支付的利息，应累加计算。</b></li>
            <li><b>您不履行或不完全履行借款合同及相关协议所约定义务的，应当依法承担违约责任并支付借款本息与实现债权的费用（包括但不限于诉讼费/仲裁费、财产保全及保全担保费用、交通费、律师费、执行费等相关费用）。</b></li>
            <li><b>若您违反借款合同及相关协议约定，依据借款合同及相关文件约定小赢有权（非义务）代为进行还款提醒、催收等贷后管理事项。</b></li>
            <li><b>若您逾期还款的，在您还清全部借款之前，小赢仍有权依照咨询服务协议约定向您收取咨询服务费。若您提前还款的，您应按相关合同约定支付提前还款手续费。若您未按咨询服务协议及相关协议约定支付费用的，需按相关约定支付违约金。</b></li>
            <li><b>其他文件约定的责任。</b></li>
        </ol><p><br />
    </p>

        <p><b>六、风险提示</b></p>

        <p>您了解并认可，通过小赢平台进行的交易并不能规避以下风险的产生，小赢也无义务为如下风险承担责任：</p>

        <p>1、宏观经济风险：因宏观经济形势变化，可能引起价格等方面的异常波动，您有可能遭受损失；</p>

        <p>2、政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，您有可能遭受损失；</p>

        <p>3、违约风险：因其他交易方无力或无意愿按时足额履约，您有可能遭受损失；</p>

        <p>4、不可抗力及意外事件风险：因战争、自然灾害、重大政治事件等不可抗力以及其他不可预见的意外事件可能致使相关交易面临损失的任何风险；</p>

        <p>5、因您的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、您使用的计算机系统被第三方侵入、您委托他人代理交易时他人恶意或不当操作而造成的损失；</p>

        <p>6、由于无法控制和不可预测的系统故障、设备故障、通讯故障、电力故障、网络故障、黑客或计算机病毒攻击以及其它因素，可能导致小赢平台出现非正常运行或者瘫痪，由此可能导致您无法按时还款等需承担的风险；</p>

        <p>7、小赢平台将按协议约定进行信息披露，您应充分关注并及时主动查询项目相关信息，如未及时查询，或由于通讯故障、系统故障以及其他不可抗力等因素的影响使得您无法及时了解项目信息，由此产生责任和风险由您承担。</p>

        <p>小赢不对您的任何交易提供任何明示或默认的保证。您应知悉交易存在的风险，且确认上述风险不可能涵盖您通过小赢平台借款潜在的所有风险，您应在独立判断后作出交易决策。交易产生的风险由您自行承担。</p>

        <p>您在做出借款决定、签署本确认书之前应认真阅读各条款内容，并认真阅读小赢平台内各项协议以及公布的各项规则的全部内容。如有任何疑问，您应向小赢平台进行咨询及寻求解释。您应仅在确认您具有识别及承担相关风险能力、确认已从小赢平台获得令您满意的信息披露、确认拟进行的交易安全符合您本身从事该交易的目的之后，才进行小赢平台上的网络借贷交易。</p>

        <p><br />
        </p>

        <p>借款人姓名：【<span>{{realName}}</span>】</p>

        <p style="margin-bottom: 1rem">身份证号：【<span>{{papersCode}}</span>】</p>
    </div>
</template>

<script>
export default {
  name: 'JieKuanQueRenShu',
  data () {
    return {
      yearCost: '',
      repayType: '',
      realName: '',
      papersCode: ''
    }
  },
  methods: {
    getInfo () {
      let params = {
        token: this.$route.params.token,
        orderCode: this.$route.params.orderCode
      }
      this.$api['bindCardZhiMaAuth/getInsuranceInfo'](params).then(res => {
        this.yearCost = res.yearCost
        this.repayType = res.repayType
        this.realName = res.realName
        this.papersCode = res.papersCode
      })
    }
  },
  filters: {
    cutFilter (val) {
      let reg = /%/g
      return val.replace(reg, '')
    }
  },
  mounted () {
    this.getInfo()
  }
}
</script>

<style scoped lang="scss">
    *{
        font-size: .37rem;
        line-height: 1.5;
    }
    p{
        padding: 0 .5rem;
    }
    a{
        text-decoration: none;
    }
    ol{
        padding: .5rem;
    }
    .queren{
        background: #f2f2f2;
        color: #333;
    }
</style>
